Revit 2024 API
Document.NewFamilyInstance Method (Curve, FamilySymbol, Level, StructuralType)
Inserts a new instance of a family into the document, using a curve, type/symbol and reference level.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilyInstance NewFamilyInstance(
	Curve curve,
	FamilySymbol symbol,
	Level level,
	StructuralType structuralType
)
Visual Basic
Public Function NewFamilyInstance ( _
	curve As Curve, _
	symbol As FamilySymbol, _
	level As Level, _
	structuralType As StructuralType _
) As FamilyInstance
Visual C++
public:
FamilyInstance^ NewFamilyInstance(
	Curve^ curve,
	FamilySymbol^ symbol,
	Level^ level,
	StructuralType structuralType
)
Parameters
curve
Type: Autodesk.Revit.DB.Curve
The curve where the instance is based.
symbol
Type: Autodesk.Revit.DB.FamilySymbol
A FamilySymbol object that represents the type of the instance that is to be inserted.
level
Type: Autodesk.Revit.DB.Level
A Level object that is used as the base level for the object.
structuralType
Type: Autodesk.Revit.DB.Structure.StructuralType
 If structural then specify the type of the component.
Return Value
If creation was successful then an instance to the new object is returned, otherwise null.
Remarks
This method is used to insert one family instance into another element along the geometry of a curve. If the instance fails to be created an exception may be thrown.
The type/symbol that is used must be loaded into the document before this method is called. Families and their symbols can be loaded using the Document.LoadFamily or Document.LoadFamilySymbol methods.
The host object must be one that supports insertion of instances otherwise this method will fail. All levels within the document can be found by iterating over the entire document and searching for objects of type Autodesk.Revit.Elements.Level.
Note: if the created family instance includes nested instances, the API framework will automatically regenerate the document during this method call.
Examples
CopyC#
FamilyInstance CreateBeam(Autodesk.Revit.DB.Document document, View view)
{
   // get the given view's level for beam creation
    Level level = document.GetElement(view.LevelId) as Level;
    // get a family symbol
    FilteredElementCollector collector = new FilteredElementCollector(document);
    collector.OfClass(typeof(FamilySymbol)).OfCategory(BuiltInCategory.OST_StructuralFraming);
    FamilySymbol gotSymbol = collector.FirstElement() as FamilySymbol;
    // create new beam 10' long starting at origin
    XYZ startPoint = new XYZ(0, 0, 0);
    XYZ endPoint = new Autodesk.Revit.DB.XYZ(10, 0, 0);
    Autodesk.Revit.DB.Curve beamLine = Line.CreateBound(startPoint, endPoint);
    // create a new beam
    FamilyInstance instance = document.Create.NewFamilyInstance(beamLine, gotSymbol,
                                                                level, StructuralType.Beam);
    return instance;
}
CopyVB.NET
Private Function CreateBeam(document As Autodesk.Revit.DB.Document, view As View) As FamilyInstance
    ' get the given view's level for beam creation
    Dim level As Level = TryCast(document.GetElement(view.LevelId), Level)
    ' get a family symbol
    Dim collector As New FilteredElementCollector(document)
    collector.OfClass(GetType(FamilySymbol)).OfCategory(BuiltInCategory.OST_StructuralFraming)
    Dim gotSymbol As FamilySymbol = TryCast(collector.FirstElement(), FamilySymbol)
    ' create new beam 10' long starting at origin
    Dim startPoint As New XYZ(0, 0, 0)
    Dim endPoint As XYZ = New Autodesk.Revit.DB.XYZ(10, 0, 0)
    Dim beamLine As Autodesk.Revit.DB.Curve = Line.CreateBound(startPoint, endPoint)
    ' create a new beam
    Dim instance As FamilyInstance = document.Create.NewFamilyInstance(beamLine, gotSymbol, level, StructuralType.Beam)
    Return instance
End Function
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the family symbol does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the level does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if The symbol is not active.
See Also
Document Class
NewFamilyInstance Overload
Autodesk.Revit.Creation Namespace